{"reviewerID": "A1YJEY40YUW4SE", "asin": "7806397051", "reviewerName": "Andrea", "helpful": [3, 4], "reviewText": "Very oily and creamy. Not at all what I expected... ordered this to try to highlight and contour and it just looked awful!!! Plus, took FOREVER to arrive.", "overall": 1.0, "summary": "Don't waste your money", "unixReviewTime": 1391040000, "reviewTime": "01 30, 2014"}
{"reviewerID": "A60XNB876KYML", "asin": "7806397051", "reviewerName": "Jessica H.", "helpful": [1, 1], "reviewText": "This palette was a decent price and I was looking for a few different shades. This palette conceals decently, however, it does somewhat cake up and crease.", "overall": 3.0, "summary": "OK Palette!", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"}
{"reviewerID": "A3G6XNM240RMWA", "asin": "7806397051", "reviewerName": "Karen", "helpful": [0, 1], "reviewText": "The texture of this concealer pallet is fantastic, it has great coverage and a wide variety of uses, I guess it's meant for professional makeup artists and a lot of the colours are of no use to me but I use at least two of them on a regular basis, and two more occasionally, which is the only reason I'm giving it for stars, I feel like the range of colors is kind of a waste for me, but the  product itself  is wonderful, it's not cakey, gives me a natural for and concealed my imperfections, therefore I highly recommend it :)", "overall": 4.0, "summary": "great quality", "unixReviewTime": 1378425600, "reviewTime": "09 6, 2013"}
{"reviewerID": "A1PQFP6SAJ6D80", "asin": "7806397051", "reviewerName": "Norah", "helpful": [2, 2], "reviewText": "I really can't tell what exactly this thing is. It's not powder but a kind of oil-ish pasty fluid. And so far I tried twice but it doesnt really show any color on my face.", "overall": 2.0, "summary": "Do not work on my face", "unixReviewTime": 1386460800, "reviewTime": "12 8, 2013"}
{"reviewerID": "A38FVHZTNQ271F", "asin": "7806397051", "reviewerName": "Nova Amor", "helpful": [0, 0], "reviewText": "It was a little smaller than I expected, but that was okay because it lasted me for a long time. I think it does great coverage for the price I paid. It is heavy, and wears off within 30-1hr. It kinda dries your skin. I'd recommend it to people who are just looking for a cheap coverage, or beginners who are just learning to conceal.", "overall": 3.0, "summary": "It's okay.", "unixReviewTime": 1382140800, "reviewTime": "10 19, 2013"}
{"reviewerID": "A3BTN14HIZET6Z", "asin": "7806397051", "reviewerName": "S. M. Randall \"WildHorseWoman\"", "helpful": [1, 2], "reviewText": "I was very happy to get this palette, now I wish it was offered in subscription form like some of the makeup we use daily is.  In this unnamed set you can do a lot of blending, sculpting, highlighting and concealing.  The product is nicely pigmented, it's smooth and applies well then blends out beautifully. I have normal to dry skin as I'm 59 years, this works wonderfully under my foundation.  I also use a silicone based primer,which works well for my skin type to give me the fresh, dewy look I love.You get a good amount of product for your money here, so this is well worth the cost.  What more can you say, if one is willing to repurchase a product then that says more than mere words.", "overall": 5.0, "summary": "Very nice palette!", "unixReviewTime": 1365984000, "reviewTime": "04 15, 2013"}
{"reviewerID": "A1Z59RFKN0M5QL", "asin": "7806397051", "reviewerName": "tasha \"luvely12b\"", "helpful": [1, 3], "reviewText": "PLEASE DONT DO IT! this just rachett the palette size is not like in the picture, the colors go on sheer, slides on face like wax don't expect  your makeup to stay put with this one. just spend the money for the good stuff. 2 thumbs down", "overall": 1.0, "summary": "smh!!!", "unixReviewTime": 1376611200, "reviewTime": "08 16, 2013"}
{"reviewerID": "AWUO9P6PL1SY8", "asin": "7806397051", "reviewerName": "TreMagnifique", "helpful": [0, 1], "reviewText": "Chalky,Not Pigmented,Wears off easily,Not a Coastal Scents Dupe,Too many highlighter colors,Does not show up on dark skinned women.I would not recommend.The coastal scents is currently on sale. It's worth the few extra bucks.", "overall": 2.0, "summary": "Chalky, Not Pigmented, Wears off easily, Not a Coastal Scents Dupe", "unixReviewTime": 1378252800, "reviewTime": "09 4, 2013"}
{"reviewerID": "A3LMILRM9OC3SA", "asin": "9759091062", "helpful": [0, 0], "reviewText": "Did nothing for me. Stings when I put it on. I used the whole tube and it just did nothing, no Lightening, no Brightening,......NOTHING. Also it tends to dry out my skin and made my face feel weird the next day. I stuck with it hoping it would LIGHTEN,.....but it didn't.", "overall": 2.0, "summary": "no Lightening, no Brightening,......NOTHING", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
{"reviewerID": "A30IP88QK3YUIO", "asin": "9759091062", "reviewerName": "Amina Bint Ibraheem", "helpful": [0, 0], "reviewText": "I bought this product to get rid of the dark spots I had on my face due to acne scars and it did help a bit.My dark spots aren't quite as noticeable but they're still there.I saw a lot of good reviews on this product, I wish it would have worked better.", "overall": 3.0, "summary": "Its alright", "unixReviewTime": 1388102400, "reviewTime": "12 27, 2013"}
{"reviewerID": "APBQH4BS48CQO", "asin": "9759091062", "reviewerName": "Charmmy", "helpful": [0, 0], "reviewText": "I have mixed feelings about this product. When I first started using it, I can see and feel the difference. It actually started to literally peel the dark skin away. There's a bit of a sting but that's how I know it was working. My skin was lighter in just a couple weeks! However, once I've stopped using it when I reached my desired skin color, it went back to being dark. I applied more and suddenly it was no longer working. It didn't peel or sting. I wonder what went wrong or if it has an expiration date or something. Overall, it works but definitely not consistent.", "overall": 3.0, "summary": "Mixed feelings.", "unixReviewTime": 1400544000, "reviewTime": "05 20, 2014"}
{"reviewerID": "A3FE8W8UV95U6B", "asin": "9759091062", "reviewerName": "Culture C Simmons", "helpful": [0, 0], "reviewText": "Did nothing for my skin. Used as suggested and no signs of brightness. Wish it worked for me, but it didn't.", "overall": 1.0, "summary": "Nothing", "unixReviewTime": 1392681600, "reviewTime": "02 18, 2014"}
{"reviewerID": "A1EVGDOTGFZOSS", "asin": "9759091062", "reviewerName": "Jessica \"Anarchykisses\"", "helpful": [0, 1], "reviewText": "I bought this product about 3 months ago, I finished my tube of xtreme  brite, as soon as I was almost done with the product I started seeing results. As I applied the gel in a circular motion i was doing so, I started to see dirt like skin come off. It was incredible :) as of today my arm pits are still white, well as they should look.", "overall": 5.0, "summary": "This works", "unixReviewTime": 1390435200, "reviewTime": "01 23, 2014"}
{"reviewerID": "AP5WTCMP6DTRV", "asin": "9759091062", "reviewerName": "Layla B", "helpful": [0, 0], "reviewText": "This gell did nothing at all. I religiously put it on specific areas for weeks and nothing changed. DON'T WASTE YOUR TIME", "overall": 1.0, "summary": "Does nothing", "unixReviewTime": 1389398400, "reviewTime": "01 11, 2014"}
{"reviewerID": "A21IM16PQWKVO5", "asin": "9759091062", "reviewerName": "mdub9922", "helpful": [0, 1], "reviewText": "i got this to get rid of a scar and it did just that, if you are looking to remove any discoloration (spot) this will get rid of it, i dont know about putting it all over your face but it def work for a spot", "overall": 5.0, "summary": "it works", "unixReviewTime": 1392681600, "reviewTime": "02 18, 2014"}
{"reviewerID": "A1TLDR1V4O48PK", "asin": "9759091062", "reviewerName": "Mickey O Neil \"Mickey O Neil\"", "helpful": [0, 0], "reviewText": "I used it for anal bleaching and it burned a bit there are no directions on it about time and how long to wear it", "overall": 2.0, "summary": "burns", "unixReviewTime": 1396742400, "reviewTime": "04 6, 2014"}
{"reviewerID": "A6F8KH0J1AVYA", "asin": "9759091062", "reviewerName": "SanBen", "helpful": [2, 4], "reviewText": "I order this cream along with their soap. It actually worked for me but after I finished the tube, I ordered different brand just to get quicker results (BAD IDEA). I am definitely ordering 3 more tubes so that my underarm pigment gets treated completely.", "overall": 5.0, "summary": "Did work for me", "unixReviewTime": 1379116800, "reviewTime": "09 14, 2013"}
{"reviewerID": "AXPKZA7UZXKTT", "asin": "9759091062", "reviewerName": "Shirleyyy", "helpful": [2, 4], "reviewText": "Good product. Use a little bit on your spot and the next day its already shedding the first layer of skin. By the 3 rd day the spot is almost gone. Cant get these results from the most expensive products", "overall": 4.0, "summary": "excellent", "unixReviewTime": 1382054400, "reviewTime": "10 18, 2013"}
{"reviewerID": "A2SIAYDK7GG7QA", "asin": "9759091062", "reviewerName": "theredtranny", "helpful": [0, 1], "reviewText": "I didn't use it past a week. The reason why is that it's smelled kind of funny. will look for another product that doesn't smell so perfumy.", "overall": 3.0, "summary": "weird smell", "unixReviewTime": 1383264000, "reviewTime": "11 1, 2013"}
{"reviewerID": "A1QV5IH6HDRN0L", "asin": "9788072216", "reviewerName": "armygirl", "helpful": [24, 24], "reviewText": "I haven't been a big fan of Prada's fragrances over the years but absolutely fell in love with the sweetness and candy-like scent of this perfume! This smells like a sweet, decadent caramel with tones of vanilla and I'm not sure what else, but it smells great! Although, I must say that this seller is asking for WAY too high a price for this bottle! You could get the 2.7 oz bottle for around the same price at Neiman Marcus (the 1.7 oz for around $80 if you prefer a smaller bottle)!", "overall": 5.0, "summary": "Love the smell of this!", "unixReviewTime": 1316390400, "reviewTime": "09 19, 2011"}