{"reviewerID": "A1LH6RF4UN9VI6", "asin": "B00H02C9TG", "reviewerName": "E. D. Garcia \"Biggie-E\"", "helpful": [0, 0], "reviewText": "So, first up:  I've been using Macs to record music since the G4 Cube... yeah, go look that up.  Anyway, I know my way around audio recording on Apple devices.And then: yeah, this thing looks kind of cheesy or flimsy...BUT: I haven't encountered anything so Plug & Play simple as the Apogee JAM 96k since Gefen introduced the iMic.  Just plug in the USB or Lightning cable, plug in your instrument and GO.Also, it's not flimsy.  It is made of plastic, but the thing has a bit of heft to it and survived a tumble to the floor from my desk.It pulls power from your machine, so no worries about some adapter introducing hum to your recordings. This also helps those of us using electric guitars that don't have extra-wound humbuckers.I tested the Apogee JAM on a new (2014) MacBook Air, an iPhone 5, and a 2013 iPad Mini.  Garageband instantly knew what was going on, but ProTools did need a bit of coaching.A small device that doesn't color input sound and doesn't get in the way... just what I needed!", "overall": 5.0, "summary": "Works great... and better than expected.", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
{"reviewerID": "A1SD1C8XK3Z3V1", "asin": "B00H02C9TG", "reviewerName": "guitfiddleblue \"guitfiddleblue\"", "helpful": [1, 2], "reviewText": "The apogee Jam works great and it sounds great. The operation is very simple: you plug in your guitar and plug in to your Mac or ios device. I have mine hooked up to my MacBook, running Garage Band. If there is any latency I can't hear it. It works beautifully. Apogee is known for making good music products and this Jam is no exception. I was able to plug in a microphone (line level) into this as well and record my vocals. Likewise, it worked well with my 4-string bass as well. I was able to record a whole song in no time. For a simple audio interface, this is affordable and dependable.", "overall": 5.0, "summary": "works great - no latency", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
{"reviewerID": "A356RFKNIG043B", "asin": "B00H02C9TG", "reviewerName": "K. Swanson", "helpful": [0, 1], "reviewText": "4.6 starsMy main concern with adapters like this is sound quality. The A/D is often weak, and there is sometimes too much latency for it to be useful for multi-tracking. Apogee covers both areas well with this little puppy; the A/D is quite smooth, and it transfers the signal near perfectly. And little it is, not much bigger than the jack. If Bon Scott only knew...But small though it may be, there's plenty of signal processing power in there, and while it doesn't stand up my best outboard gear, it offers very clean, clear sound transfers from guitar, bass, keys and line mics, so that you can do good-sounding entire tunes on your laptop with only the JAM as interface. Which is yet another step forward in high-quality home recordings. I like the thought that we're getting closer to folks releasing things entirely by themselves on their own sites, and not paying Crapple a huge chunk of profits for merely hosting a file. Record companies and file hosts are increasingly anachronistic due to tech like this JAM, and maybe soon enough we'll see artists keeping ALL of the profits from their art. Imagine that!This offers very close to studio quality, but keep in mind that even with 24-bit it is solid state. Once you've used a good tube preamp you know what a difference in warmth in can make. I ran this through one of mine and the A/B made it very obvious that old school studio gear still has its place.Speaking of Crapple, the ads for this suggest that it is for iStuff only, which is not true. I ran it on 7 Ultimate and it worked a charm, so don't be fooled by the typically proprietary ads, which Cook and co. probably insist on: &#34;Don't mention anybody but us! Offer no alternatives! They must stay in our universe!&#34; Well, you needn't, this works with almost anything, so don't be fooled by the ad copy.The only negative I can find is that it is a little chintzy in outer build, making one wonder how good the internals are, and how long they'll hold up. A stronger, more solid sleeve would have been nice, especially at the price of 130. But it does sound good, though as it may be used for portable purposes, you might want to wrap it for transport in a little hand towel or such to make sure shocks don't mess with it. Take care of your recording equipment and it will take care of your music!", "overall": 5.0, "summary": "Good clear A/D, almost no latency, and works with Windoze", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
{"reviewerID": "A2VH0UT5EQFB6P", "asin": "B00H02C9TG", "reviewerName": "Loveguitar", "helpful": [0, 0], "reviewText": "This will work with my daughter's iPod Touch generation 4.  However, the \"Garage Band\" app is for iOS 7, and hers is an iOS 6.1 and will not update to 7.  So, though she can't use Garage Band, there are others that are supposed to work.  She downloaded the Ampkit app and it works great with her iPod and the Apogee Jam.Here is a list of other apps that are supposed to work with the Apogee Jam:AmpkitAmpliTube (version 2.5 or greater)Amps & CabsAnytuneApple GarageBandAudio Deck ProfessionalBias iProRecorderEveryDay LooperFairlight SamplerFantastocrats StudioMiniGibson's L&M;Hindenburg Field RecorderiAnalyzeriMovieiRecorder ProiShred LiveJamUpLoopyMcDSP Retro RecorderMultitrack DAWNano Studio (TRG-16 pad sampling)PocketAmpPocketGKReap DFXRiot FXRock Prodigy: GuitarScratchTonesSonoma FourTrackSonoma GuitarToneStudio Devil Guitar AmpTaylor EQVocaLive (version 1.5 or greater)Voice MemosXewton Music Studio 2.0It's a pretty cool idea, but the cords are a nuisance.  Most electric guitar players like to stand while playing, and the cords need some managing to keep them out of the way and not have them pull out of their connections.  I was surprised at how small the JAM is.....slightly bigger than a Bic cigarette lighter.  Using this is much more convenient than lugging an amp around, and it saves on other's ears and nerves if they can only hear the acoustic playing of the guitar strings, especially if you are beginner guitarist!Overall pretty good, and very simple to operate.  Just make sure you have a full charge on the device of your choice.  My daughter also used it to record her playing and said that was easy to do.", "overall": 4.0, "summary": "Apogee JAM 96K Guitar Input for iPad, IPhone and Mac", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
{"reviewerID": "A1RPTVW5VEOSI", "asin": "B00H02C9TG", "reviewerName": "Michael J. Edelman", "helpful": [1, 1], "reviewText": "I've been recording on my iMac, iPod Touch, iPad, and iPhone for some time, using Garage Band. Interfacing with the iMac is easy, using various USB devices- I'm currently using a USB-equipped Alesis preamp. iOS device interface is a bit more difficult; it is possible to use USB preamps, with an externally powered USB hub, but that starts getting very complicated and messy.  I've been using simple devices like the 1K that  split the headphone/microphone jack into two separate cords, one for headphone, and one for guitar. The problem with this sort of configuration is that it's very easy to overload the microphone input, and the recording quality done this way is not very good. The Apogee JAM is a big improvement over this method for a number of reasons. First, it contains its own dedicated preamp and A/D, and because of that it delivers a wide dynamic range and excellent fidelity. Interface issues are non-existent; plugged into both the iPad and iPhone it was immediately recognized. I didn't have any problems with either of the three supplied cables.The JAM is significantly more expensive than the simple interfaces, but on the whole I think it's worth it. It's simple to use, has no detectable latency, and delivers excellent sound quality. It does seem to draw a fair amount of current, and battery life  is shortened significantly when using this with an iPhone. You'll want to plan on more frequent than usual recharging sessions. With the iPad, this isn't as noticeable. Even with that issue, I think the JAM is a good value.  The various iOS devices are capable of making very high quality recordings, but only with quality input. Given the cost of an new iPhone or iPad, the cost of the JAM is rather trivial in comparison.", "overall": 5.0, "summary": "Excellent sound, low latency, plug and play", "unixReviewTime": 1403395200, "reviewTime": "06 22, 2014"}
{"reviewerID": "ABC68JUCPTVOE", "asin": "B00HFRXACG", "reviewerName": "A. Fabbri \"afabbri\"", "helpful": [0, 0], "reviewText": "These may be my new favorite bass strings.Likes:- Bright.  I'd call them &#34;very bright&#34;, except they don't seem to have the harsh twangy tone I'd expect.  They seem bright, yet still soft.- Clear.. The lows sound present and clear.- Consistent flex.  Once I had these on for a couple of days, the tuning seemed very stable.  The tone seems to sharpen less when they are played hard, compared to my last strings.- D'Addario brand.  To me, these guys have a long history of making excellent strings.- Playability.  These feel pretty supple and effortless to work with.- Price. I feel like I should be paying more for these strings.Technology:- New design. &#34;Textured round&#34;.  This is a round-wound string with a hex-shaped core.Overall, love these.  Especially for the price.", "overall": 5.0, "summary": "D'Addario has a hit on their hands.", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
{"reviewerID": "A3VVKC910FN4EK", "asin": "B00HFRXACG", "reviewerName": "David Basham", "helpful": [1, 1], "reviewText": "This is the perfect fit for all my basses. I have two Ibanez and two Essex basses. They recommend the light top medium bottom string gauge. I play fingerstyle and they feel great. They have corrosion resistant packaging and since corrosion is what kills your strings the longer you can keep it at bay the better. They are made in  the USA and they use recycled packaging. I cannot attest to their lifespan but the package says long life so we will concede that point.", "overall": 5.0, "summary": "Just my size", "unixReviewTime": 1401667200, "reviewTime": "06 2, 2014"}
{"reviewerID": "A20OBCQWBKCGZT", "asin": "B00HFRXACG", "reviewerName": "Flaherty", "helpful": [0, 0], "reviewText": "I'm mainly a guitarist but I do play bass from time to time on an old Fender American. These strings are very bright in a good way with a clear, smooth sound. I love the tone you get out of these, very bluesy and the punch isn't too rough it's just right. I'm a huge fan of D'Addario, been using their strings for at least 4 years and they never disappoint. Give these a try if you're looking for some new strings.", "overall": 5.0, "summary": "D'Addario does it again, great punch and bright tone", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
{"reviewerID": "A3AOPVQ7EZHTWA", "asin": "B00HFRXACG", "reviewerName": "frankp93 \"frankp93\"", "helpful": [2, 2], "reviewText": "I put the set on my Squire Jazz Bass with threaded bridge rollers. If you don't like loading up the tuners, trim a few inches off the leads; they're about 8-9 inches and have no cloth covering like Fenders. I usually play medium gauge flatwounds on this bass and the FlexSteels have overall less tension. I let out the truss rod a half turn to eliminate buzzing (yeah, ironic for a set designed for slapping).Gave them a good stretch and they're holding pitch well. I find the windings on the FlexSteels more comfortable than Rotosounds - at least comparing new-to-new. That helps when playing more horizontally with a lot of position shifting.Overall I'm more into jazz and classic prog than slapping and there's plenty of 'piano low-end sproing' (Squire, Lake and Ray Bennett fans will feel right at home, fingers or pick). The set is so bright-sounding in fact I had to roll a considerable amount off.The label says 'Light Top/Medium Bottom' (45-65-85-105): I found the gauge balance between the low E-A and the high D-G a little more pronounced than I'd like, but not outright uncomfortable.", "overall": 4.0, "summary": "Comfortable Alternative to Rotosounds", "unixReviewTime": 1403481600, "reviewTime": "06 23, 2014"}
{"reviewerID": "A2VRAT69JDAD3W", "asin": "B00HFRXACG", "reviewerName": "Jason Whitt \"Whittmeister\"", "helpful": [2, 2], "reviewText": "I've been using D' Addario strings for 20+ years to great satisfaction.  These flex steels are excellent.  Bass tones, response and resonance are superior to my ear.  You can't go wrong with these guys.", "overall": 5.0, "summary": "D' Addario is the best", "unixReviewTime": 1403136000, "reviewTime": "06 19, 2014"}
{"reviewerID": "A356RFKNIG043B", "asin": "B00HFRXACG", "reviewerName": "K. Swanson", "helpful": [1, 1], "reviewText": "I play guitar and bass, but the gitpicker in me envies full-time bassists because they almost never break strings, and bass strings hold their tone far longer than guitar strings. The price has also come down to where you can spend well under a hundred bucks a year on strings and always have fresh tone rich with harmonics. You don't know how good you've got it! And these D'Ad's are very good all-round strings, though they make a lot more noise than flatwounds and even \"normal\" nickel wound, so they're not for sloppy fingers.Very nice for funky players and those who want more definition and edge, these FlexSteels ring nicely and I like that the bottom E is a tad thicker at 105 than the usual light set's 100. Because these are pretty bright, that extra oomph is nice. And I'm a big believer that the amp can fix string issues much more easily with bass than guitar, so merely dialing out a little treble or even rolling off the volume a bit on your bass will take care of that. But if you're popping and slapping, these come through loud and clear. I really like the feel of the low E when I thumb pop with these.I play a P-bass with my index, middle and thumb, and these punch nicely at that scale length. The pickups also like them, and they get plenty loud, with full definition and plenty of top end, but not brittle. With a Trace Elliot or other high-def amp, these would be very unforgiving for all but the most exact players. I bet Marcus would kill with them.I think these are perfect for funk, and excellent for almost all rock styles. Obviously flats are better for jazz, but these make a good all-around string and for less than 20 clams they're a great deal.", "overall": 5.0, "summary": "You lucky basstards!", "unixReviewTime": 1402617600, "reviewTime": "06 13, 2014"}
{"reviewerID": "A3KZEGBTPH6MMF", "asin": "B00HFRXACG", "reviewerName": "Lucy Cat \"Mandy\"", "helpful": [0, 0], "reviewText": "A great set of bass strings with all the right features:- Perfect balance of bright/punch and warmth- Right, deep tones- Great feel and playability- Stable tuning- &#8220;Textured round&#8221; design with hexagonal core shape- Durable- Easy to stringMy father uses D&#8217;Addario on his telecaster and acoustic guitars, which originally prompted me to choose D&#8217;Addario for my Fender Jazz bass.  I can say that the brands&#8217; reputation carries over to bass&#8212;these are phenomenal strings.", "overall": 5.0, "summary": "Tremendous strings", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
{"reviewerID": "A1RPTVW5VEOSI", "asin": "B00HFRXACG", "reviewerName": "Michael J. Edelman", "helpful": [1, 1], "reviewText": "I've been using D'Addario XL nickel wounds on my P-Bass for a long time. They have a lot of tone, they seem to last a long time, and they're not very expensive. These strings have the same feel as the nickel wounds, but are a lot brighter You get lots of overtones and high end from these. The choice of gauges is a little different from the regular XLs, too; instead of the .085 A and the .100 E they have a .085 A and a .105 E. That's just enough to give you a slightly more solid low end, and more metal to dig into, while retaining low tension in the D and G. I'm more of an old-school player and prefer nickel for that mellower sound, but if you're into funk or more modern sounds, you may feel that the bright SS sound is for you, and if so, these are a great string.", "overall": 4.0, "summary": "Very bright", "unixReviewTime": 1401062400, "reviewTime": "05 26, 2014"}
{"reviewerID": "AWCJ12KBO5VII", "asin": "B00HFRXACG", "reviewerName": "Michael L. Knapp", "helpful": [2, 2], "reviewText": "I installed these on a Fender Jazz bass with active electronics. After stringing them up & tuning I immediately noticed how really sharp they sounded. I play finger style and they really added a clear definition to each note played. They sounded great all up & down the fret board. Where I really noticed the difference was in recording. Been working on a new batch of songs and a the bass to the songs on the recordings made after these strings is noticeably superior to the ones made before. Except for the songs with acoustic bass I will be going back and re recording the bass parts to the songs made before I installed these strings. I  don't play slap or pick bass so I can't say how well they work for those styles but for my purpose they come very highly recommended.", "overall": 5.0, "summary": "Fine strings", "unixReviewTime": 1402963200, "reviewTime": "06 17, 2014"}
{"reviewerID": "A29B4PAIOL7HYG", "asin": "B00HFRXACG", "reviewerName": "N. Caruso \"gibsonjunkie\"", "helpful": [1, 1], "reviewText": "I have to admit this up front - I'm a terrible bass player. I play guitar and keep a bass in the music room for times when I have friend over to jam. I do dabble with the bass, but I'm not proficient with it. That being said; I really appreciate the difference these strings make in sound, playability and durability. These strings sound better and feel great to play for long periods of time. They have &#34;punch&#34; and &#34;snap&#34; which are good things to have in a bass. I haven't had them on for a real long time, but in the time I've had them they remain consistent and show absolutely no sound or metal degradation in the time they've been on my Fender MIM Jazz bass. When I need another set, I'll buy these!", "overall": 5.0, "summary": "Great strings", "unixReviewTime": 1402444800, "reviewTime": "06 11, 2014"}
{"reviewerID": "A27L5L6I7OSV5B", "asin": "B00HFRXACG", "reviewerName": "Otto Correct", "helpful": [0, 0], "reviewText": "These are some bright strings!I play with a pick and mostly stay in the realm of rock 'n' roll, so no comments on the slapping and popping claims the packaging makes, but there are plenty of great rock tones to be found.  Heck, crank the amp and dig in with a pick and these would be great strings for any Motorhead covers you're planning on playing!  Good bright steel tone, not anywhere near as harsh on your fingertips (or frets!) as Rotosounds, and they're only a Jackson, not a bad string!", "overall": 5.0, "summary": "Great for the price!", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
{"reviewerID": "ABC68JUCPTVOE", "asin": "B00IZCSW3M", "reviewerName": "A. Fabbri \"afabbri\"", "helpful": [0, 0], "reviewText": "Likes:- Pretty smooth.  Minimal fret noise and squeak compared to some- Bright, strong mids.- They do seem to stay in tune well.  Havent had to change tuning once they settled in.Will update this review with more experience as I play on these strings over the next week.", "overall": 5.0, "summary": "Great strings.", "unixReviewTime": 1403136000, "reviewTime": "06 19, 2014"}
{"reviewerID": "AV8MDYLHHTUOY", "asin": "B00IZCSW3M", "reviewerName": "Amazon Customer \"eyegor\"", "helpful": [1, 1], "reviewText": "My daughter is learning how to play and the .11 - .48 string set on my strat are giving her a literal pain.I put a set of the D'Addario NYXY0942 strings on my backup guitar and tuned it up. Usually, I've had issues when bringing some brands of strings up to pitch, but the D'Addario's seemed to do a much better job. I nearly always stress the higher pitch strings a bit before bringing them up to their final pitch and they stabilized quickly. The wound strings also seem quite stable. Frequently, it takes up to a couple of days for some strings to settle in, but I've seen no such issues with the D'Addario's.I usually use thicker strings on my guitars to get a fatter tone, but I was impressed by the sound of these in spite of them being much thinner than I usually like.My daughter is also very happy with them since they're not quite so tough on her fingers.", "overall": 4.0, "summary": "very nice extra light strings", "unixReviewTime": 1400112000, "reviewTime": "05 15, 2014"}
{"reviewerID": "A146H4KN4LFR60", "asin": "B00IZCSW3M", "reviewerName": "angelfood", "helpful": [2, 2], "reviewText": "Put these on my G&L; S500 electric. Sound great, play great, keeping their tune. None broken yet, but I don't usually break strings. I play at home for pleasure and recording, not out hitting the clubs. Blues, blues slide, rock, metal.I use D'Addario strings a lot. I try others but always come back to them. These will probably be my go to strings on electric guitar from now on. I really like them.", "overall": 5.0, "summary": "Hammer, Bend, Thrash It!", "unixReviewTime": 1400976000, "reviewTime": "05 25, 2014"}
{"reviewerID": "ABKNRVFFLEA3M", "asin": "B00IZCSW3M", "reviewerName": "bertrarious \"bertrarious\"", "helpful": [1, 1], "reviewText": "I usually don't use anything lighter than 10s because I think the tone starts to get thin on both the highs or the lows.  I had already tried these in the 10 gauge size, and when these were offered via the Vine program, I thought what the heck.  I have a guitar which I believe the tension is always high and tried these on that instrument.  They do seem to help the string tension issue and the low end sounds (to these 62 year old ears) quite comparable to the 10s.  However, I do think there is still a thinning of the high end, but that's subjective.  I gave the 10s a 5 rating, and, realistically, I would give these 4.5 id I could.  If you're into 9 gauge strings I recommend these, but I'll stick with 10s and 11s.", "overall": 4.0, "summary": "Very good strings, tone starts to thin", "unixReviewTime": 1399593600, "reviewTime": "05 9, 2014"}